# На вершині гори стоїть золотошукач (Смайлик нагорі). Цифра у клітині
# позначаєкількість золотих злитків, які в ній зберігаються. Золотошукач може за один
# раз або спуститися на одну клітинку вниз, або спуститися на одну клітинку вниз і
# праворуч. Продумайте алгоритм для програми, щоб визначити максимальну кількість
# золотих злитків, які може знайти золотошукач, рухаючись від вершини гори вниз.

mountain = [
    [7],
    [5, 8],
    [9, 8, 2],
    [1, 3, 5, 6],
    [6, 2, 4, 4, 5],
    [9, 5, 3, 5, 5, 7],
    [7, 4, 6, 4, 7, 6, 8]
]

inde_x = 0
result = 0
for i in range(len(mountain)):
    if i == 0:
        result +=mountain[i][0]
    else:
        move_down = mountain[i][inde_x]
        move_right = mountain[i][inde_x+1]
        if move_down >= move_right:
            result+=move_down
        else: result +=move_right
inde_x +=1
print(result)







